/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: spc_slave.c
**
** 创   建   人: Zhang.ZhaoGe (张兆阁)
**
** 文件创建日期: 2018 年 07 月 15 日
**
** 描        述: spc 从机端代码 (模拟了载荷端功能)
*********************************************************************************************************/

#include "pthread.h"
#include "stdlib.h"
#include "string.h"
#include "getopt.h"
#include "stdint-gcc.h"
#include <stdio.h>
#include <endian.h>
#include <sys/types.h>
#include <unistd.h>
#include <iostream>
#include <string>


#include "hex.h"

/*********************************************************************************************************
  数据类型定义
  [start flag 0x5A][2B long][xB data][end flag 0xA5][...]
*********************************************************************************************************/
typedef struct
{
    unsigned char ucStartFlag;
    int16_t  usDataLong; /*  最大是 496 字节             */
    unsigned char ucData[1];
} __attribute__((packed)) ProtocolDataHead;
/*********************************************************************************************************
  宏定义
*********************************************************************************************************/
#define IMPORTPRIVKEYLEN 43 /*  导入私钥命令长度            */
#define PRIVKEYLEN 52       /*  冷钱包私钥字节长度          */
#define RCVBUFLEN 50        /*  接收数据缓冲区打小          */
#define ALLRCVBUFLEN 500    /*  接收数据缓冲区打小          */
#define SENDBUFLEN 198      /*  发送数据缓冲区打小          */
#define ALLSENDBUFLEN 2048  /*  发送数据缓冲区打小          */
#define CANBUAD 500000      /*  can 波特率                  */
#define CANDEV "/dev/can0"  /*  can 设备文件                */
/*  交易签名命令                */
#define STARTSTR " ["                                    /*  txid key 开始字符串         */
#define TXIDSTR "{\\\"txid\\\":\\\""                     /*  txid key 字符串             */
#define VOUTSTR "\\\",\\\"vout\\\":"                     /*  vout key 字符串             */
#define PUBKEYSTR ",\\\"scriptPubKey\\\":\\\""           /*  pubkey key 字符串           */
#define REDEEMSCRIPTSTR "\\\",\\\"redeemScript\\\":\\\"" /*  amount key 字符串           */
#define ENDSTR "\\\"},"                                  /*  end 字符串                  */
#define ENDENDSTR "]"                                    /*  end end 字符串              */
#define PRIVKEYSTARTSTR " [\\\""                         /*  priv key start 字符串       */
#define PRIVKEYENDSTR "\\\"]"                            /*  priv key end 字符串         */

#define PRIVKEYFILEDIC "/root/key/" /*  priv key 文件路径           */
#define IMPORTPRIVKEYSTR "/root/qtum/qtum-cli importprivkey "
/*  导入私钥命令                */
/*********************************************************************************************************
  全局变量定义
*********************************************************************************************************/


/*********************************************************************************************************
** 函数名称: spcStringStrip
** 功能描述: 去除缓冲区中的回车和空格
** 输　入  : cString ：需要格式化的缓冲区
**         : iLen    ：字符串长度
** 输　出  : 格式化后的字符串首地址
** 全局变量:
** 调用模块:
*********************************************************************************************************/
char *spcStringStrip(char *cString, int iLen);
/*********************************************************************************************************
** 函数名称: spccharToHex
** 功能描述: 把字符转成二进制数
** 输　入  : cIn
** 输　出  : 结果
** 全局变量:
** 调用模块:
*********************************************************************************************************/
unsigned char spccharToHex(char cIn);
/*********************************************************************************************************
** 函数名称: spcHexTochar
** 功能描述: 把字符转成二进制数
** 输　入  : cIn
** 输　出  : 结果
** 全局变量:
** 调用模块:
*********************************************************************************************************/
char spcHexTochar(unsigned char ucIn);
/*********************************************************************************************************
** 函数名称: spcStringToHex
** 功能描述: 把 hash 字符串转换成二进制数据格式（"0123456789abcdef" --- 0x0123456789abcdef）
** 输　入  : cString    ：字符串地址
**         : iLen       ：字符串长度
**         : ucOutData  ：转换结果
** 输　出  : 成功转换的字符个数
** 补充信息: 需要注意输入字符串字符个数是奇数的情况以及 ucOutData 在调用的时候需要清空一下
** 全局变量:
** 调用模块:
*********************************************************************************************************/
int spcStringToHex(unsigned char *ucOutData, char *cString, int iLen);
;
/*********************************************************************************************************
** 函数名称: spcHexToString
** 功能描述: 把二进制数据格式转换成 hash 字符串（0x0123456789abcdef --- "0123456789abcdef"）
** 输　入  : cString     ：二进制数据地址
**         : iLen        ：有效的字节个数
**         : bIs         ：ucInData 最后一个字节数据是否只有一半有效（输出字符个数是否为奇数个）
**         : cOutString  ：转换结果
** 输　出  : 字符串长度
** 全局变量:
** 调用模块:
*********************************************************************************************************/
int spcHexToString(char *cOutString, unsigned char *ucInData, int iLen, bool bIs);
/*********************************************************************************************************
** 函数名称: spcRcvDataToCmdString
** 功能描述: 把接收到的压缩数据转换成签名时执行的字符串命令
** 输　入  : ucDest：存储结果的缓冲区
**         : ucSrc ：接收的压缩数据
**         : iLen  ：ucDest 缓冲区长度
** 输　出  : ERROR_CODE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
int spcRcvDataToCmdString(char *ucDest, int iLen, unsigned char *ucSrc);
/*********************************************************************************************************
** 函数名称: spcImportPrivKey
** 功能描述: 导入冷钱包私钥
** 输　入  : cPrivKey  ：私钥字符串地址
**         : ucPrivNum ：私钥个数
** 输　出  : 操作结果字符串长度（含'\0'），结果存储在了 _G_ucAllSendBuf 中
** 全局变量:
** 调用模块:
*********************************************************************************************************/
int spcImportPrivKey(char *cPrivKey, unsigned char ucPrivNum);

/*********************************************************************************************************
** 函数名称: spcProcessfile
** 功能描述: 从文件读取签名请求数据包
** 输　入  : 无
** 输　出  : 无
** 全局变量:
** 调用模块:
*********************************************************************************************************/
int spcProcessfile();
/*********************************************************************************************************
  END
*********************************************************************************************************/
